:PROPERTIES:
:ID:       ab3eefdb-1dae-404b-afc0-be939c55769f
:END:
#+TITLE: NixOS: Fix GnuPG Agent and SCDaemon
#+CATEGORY: slips
#+TAGS:  
* Methods

It's still complaining about =pinentry=. Probably needs restart

#+begin_src shell
gpgconf --check-programs 
gpgconf --list-dirs
#+end_src

Apparently, you can dump config state using

#+begin_src shell :results output table
component=scdaemon
# if the final char in each line is ':', it's just a default
gpgconf --list-options $component \
      | cut -f1,4 -d':' | tr ':' '\t'
#+end_src

#+RESULTS:
| Monitor              | Options controlling the diagnostic output         |
| verbose              | verbose                                           |
| quiet                | be somewhat more quiet                            |
| debug-level          | set the debugging level to LEVEL                  |
| log-file             | write a log to FILE                               |
| Configuration        | Options controlling the configuration             |
| reader-port          | connect to reader at port N                       |
| ctapi-driver         | use NAME as ct-API driver                         |
| pcsc-driver          | use NAME as PC/SC driver                          |
| disable-ccid         | do not use the internal CCID driver               |
| card-timeout         | disconnect the card after N seconds of inactivity |
| disable-pinpad       | do not use a reader's pinpad                      |
| enable-pinpad-varlen | use variable length input for pinpad              |
| application-priority | change the application priority to LIST           |
| Security             | Options controlling the security                  |
| deny-admin           | deny the use of admin card commands               |

Check =gpg-agent='s pinentry, which is missing an explicit option.

#+begin_src shell
component=gpg-agent
gpgconf --list-options $component \
    | grep -i pinentry \
    | cut -f1,4 -d':' | tr ':' '\t'
#+end_src

#+RESULTS:
| Pinentry                   | Options controlling the PIN-Entry             |
| no-allow-loopback-pinentry | disallow caller to override the pinentry      |
| pinentry-timeout           | set the Pinentry timeout to N seconds         |
| allow-emacs-pinentry       | allow passphrase to be prompted through Emacs |

dump everything

#+begin_src shell
ga=$(mktemp -d)
for c in $(gpgconf --list-components | cut -d':' -f1); do
    gpgconf --list-options $c > $ga/$c.conf.orig;
done

# now restart/reload and repeat using $ga/$c.conf as suffix
#+end_src

It actually turns out that this only dumps the defaults. =man gpgconf= shows that
the final value in each line would be the active value .....


